org/wiki/bash-shell-tips.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+TYPE: wiki
#+LAYOUT: post
#+AUTHOR: carltonf
#+DATE: 2015-07-31 Fri 17:31
#+TITLE: Bash/Shell Tips
#+DESCRIPTION: A collection of Bash Tips 
#+TAGS: Bash,tips
#+CATEGORIES: 

* Remove Some Files But Not All

** Shell Pattern (=glob= and =extglob=)

*** Basic Glob

=?=: one char; =*=: any number of chars; =[..]=: one of the char

*REMARK*: Very limited, trying to figure out the right pattern might be even
harder and more time consuming than the toolchain method (see below).

*** =extglob=

Need to turn on this feature: =shopt -s extglob=.

=!(.|.|.)=: anything that doesn't match patterns


** Use extra tools

One example: =ls | grep ... | xargs rm=

* Multiple Pipes
** Common Grep Buffer Issue
Use =--line-buffered=, a GNU grep extension.

- Example
  : adb shell 'getevent /dev/input/event4' | grep --line-buffered "0003 0019" | tee tmp.txt

** Other Stdout Buffer Issue
Use complex =while-read-line= structure.

- Example
  : tail -f logfile | while read line ; do echo "$line"| grep 'org.springframework'|cut -c 25- ; done
