_wiki/2015-07-31-bash-shell-tips.html
---
collections: wiki
layout: post
title: Bash/Shell Tips
date: 2015-07-31
categories: 
-
tags: 
- Bash
- tips
author: carltonf
excerpt: A collection of Bash Tips 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Remove Some Files But Not All</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Shell Pattern (<code>glob</code> and <code>extglob</code>)</h3>
<div class="outline-text-3" id="text-1-1">
</div><ul class="org-ul"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Basic Glob<br  /><div class="outline-text-4" id="text-1-1-1">
<p>
<code>?</code>: one char; <code>*</code>: any number of chars; <code>[..]</code>: one of the char
</p>

<p>
<b>REMARK</b>: Very limited, trying to figure out the right pattern might be even
harder and more time consuming than the toolchain method (see below).
</p>
</div>
</li>

<li><a id="sec-1-1-2" name="sec-1-1-2"></a><code>extglob</code><br  /><div class="outline-text-4" id="text-1-1-2">
<p>
Need to turn on this feature: <code>shopt -s extglob</code>.
</p>

<p>
<code>!(.|.|.)</code>: anything that doesn't match patterns
</p>
</div>
</li></ul>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Use extra tools</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One example: <code>ls | grep ... | xargs rm</code>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Multiple Pipes</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Common Grep Buffer Issue</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Use <code>--line-buffered</code>, a GNU grep extension.
</p>

<ul class="org-ul">
<li>Example
<pre class="example">
adb shell 'getevent /dev/input/event4' | grep --line-buffered "0003 0019" | tee tmp.txt
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Other Stdout Buffer Issue</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Use complex <code>while-read-line</code> structure.
</p>

<ul class="org-ul">
<li>Example
<pre class="example">
tail -f logfile | while read line ; do echo "$line"| grep 'org.springframework'|cut -c 25- ; done
</pre>
</li>
</ul>
</div>
</div>
</div>
